scripts/xcoord/results/poc0_uvm_20260223_154122/bench_uvm_cpu_stress_pinned.txt
INFO 02-23 15:59:03 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7df9492e12d0>, seed=0, num_prompts=20, dataset_name='sharegpt', no_stream=False, dataset_path='/home/yunwei37/workspace/gpu/gpu_ext/workloads/llama.cpp/datasets/sharegpt_vicuna.json', no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url='http://127.0.0.1:8013', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=1, model='gpt-oss-120b-mxfp4', tokenizer='Qwen/Qwen3-30B-A3B-FP8', use_beam_search=False, logprobs=None, request_rate=0.2, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:09 elapsed, 281:23:57 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 0.2
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 20/20 [06:35<00:00, 19.77s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     20        
Maximum request concurrency:             1         
Request rate configured (RPS):           0.20      
Benchmark duration (s):                  395.37    
Total input tokens:                      4270      
Total generated tokens:                  5153      
Request throughput (req/s):              0.05      
Output token throughput (tok/s):         13.03     
Peak output token throughput (tok/s):    146.00    
Peak concurrent requests:                2.00      
Total Token throughput (tok/s):          23.83     
---------------Time to First Token----------------
Mean TTFT (ms):                          3169.66   
Median TTFT (ms):                        2307.24   
P99 TTFT (ms):                           7407.45   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          73.50     
Median TPOT (ms):                        74.37     
P99 TPOT (ms):                           132.31    
---------------Inter-token Latency----------------
Mean ITL (ms):                           65.67     
Median ITL (ms):                         58.68     
P99 ITL (ms):                            202.54    
==================================================